**** `jk` normal mode fix 

Lean4-mode uses quail to replace LaTeX-like symbols \alpha with the
unicode equivalents. This interferes with key-chored mode which also
uses quail under the hood. This function adds jk directly to the quail
map in lean4-mode so that jk keeps working. 

#+begin_src emacs-lisp :lexical t 
     (defun quail-jk (key idx) 
       (let ((curpos (point)))
	 (quail-delete-region)
	 (evil-normal-state)
	 (run-at-time 0.01 nil (lambda () (goto-char (- curpos (if (bolp) 1 2)))))
	 (throw 'quail-tag nil))
       )

    (add-hook 'lean4-mode-hook (lambda ()
	(setq lsp-inlay-hint-enable nil)
	(setq lsp-warn-no-matched-method nil)
	(quail-define-rules ((append . t)) ("jk" quail-jk))))
#+end_src

#+RESULTS:
| (closure (t) nil (setq lsp-inlay-hint-enable nil) (setq lsp-warn-no-matched-method nil) (quail-define-rules ((append . t)) (jk quail-jk))) | (lambda nil (setq lsp-inlay-hint-enable nil) (setq lsp-warn-no-matched-method nil) (let ((tail '((jk quail-jk))) (map (quail-map)) (decode-map (and (quail-decode-map) (not nil))) (properties 'nil) key trans) (while tail (progn (setq key (car (car tail))) (setq trans (car (cdr (car tail)))) (setq tail (cdr tail))) (quail-defrule-internal key trans map t decode-map properties)))) | lsp |

** Documentation
We will use helm together with helm-dash to view documentation in
emacs.
#+begin_src emacs-lisp
  (setq helm-dash-common-docsets '("Python 2" "Haskell" "Sage" "Emacs Lisp"))
#+end_src

#+RESULTS:
| Python 2 | Haskell | Sage | Emacs Lisp |


We will display the documentation in the eww web-browser in emacs.

We set the font to match the rest of emacs instead of the font
provided from html. We also force the browser to pop up on the left if
possible otherwise split vertically.
#+begin_src emacs-lisp
  (setq counsel-dash-browser-func 'eww-browse-url)

  (add-hook 'eww-mode-hook 'eww-toggle-fonts)

  (defun eww-display+ (buf _alist)
    (let ((w (or
	       (window-in-direction 'left)
	       (split-window-vertically))))
      (set-window-buffer w buf) w))

  (push `(,(rx "*eww*")
	(eww-display+))
	display-buffer-alist)
#+end_src

#+RESULTS:
| \*eww\* | (eww-display+) |
| \*eww\* | (eww-display+) |

*** Hippie Expand
#+begin_src emacs-lisp
  (global-set-key (kbd "M-/") 'hippie-expand)

  ;; https://blog.binchen.org/posts/autocomplete-with-a-dictionary-with-hippie-expand.html
  ;; The actual expansion function
  (defun try-expand-by-dict (old)
    ;; old is true if we have already attempted an expansion
    (unless (bound-and-true-p ispell-minor-mode)
      (ispell-minor-mode 1))

    ;; english-words.txt is the fallback dicitonary
    (if (not ispell-alternate-dictionary)
	(setq ispell-alternate-dictionary (file-truename "~/.emacs.d/misc/english-words.txt")))
    (let ((lookup-func (if (fboundp 'ispell-lookup-words)
			   'ispell-lookup-words
			 'lookup-words)))
      (unless old
	(he-init-string (he-lisp-symbol-beg) (point))
	(if (not (he-string-member he-search-string he-tried-table))
	    (setq he-tried-table (cons he-search-string he-tried-table)))
	(setq he-expand-list
	      (and (not (equal he-search-string ""))
		   (funcall lookup-func (concat (buffer-substring-no-properties (he-lisp-symbol-beg) (point)) "*")))))

      (if (null he-expand-list)
	  (if old (he-reset-string))
	(he-substitute-string (car he-expand-list))
	(setq he-expand-list (cdr he-expand-list)) t)))

    (global-set-key (kbd "M-/") 'hippie-expand)
    (setq hippie-expand-try-functions-list
	  '(try-expand-dabbrev
	  try-expand-dabbrev-all-buffers
	  try-expand-dabbrev-from-kill
	  try-complete-file-name-partially
	  try-complete-file-name
	  try-expand-all-abbrevs
	  try-expand-list
	  try-expand-line
	  try-complete-lisp-symbol-partially
	  try-complete-lisp-symbol))
#+end_src

#+RESULTS:
| try-expand-dabbrev | try-expand-dabbrev-all-buffers | try-expand-dabbrev-from-kill | try-complete-file-name-partially | try-complete-file-name | try-expand-all-abbrevs | try-expand-list | try-expand-line | try-complete-lisp-symbol-partially | try-complete-lisp-symbol |

